[
    {
        "date": "2023-10-17T12:42:32+00:00",
        "channel_name": "Dormitory #19 KPI",
        "message_id": 369,
        "text": "🟢**Administration\n\nPoints of Resilience\n**Points of resilience will be located in working rooms 9, 13, and 14 of the dormitories. They promise to organize points in each dormitory where there is shelter and a working generator.\n\n**Heating\n**It will gradually appear in the student campus by the end of the week.\n\n**Windows\n**The student campus purchased windows through a tender to insulate the dormitories, but during installation, it turned out that the specifications indicated windows of the wrong size.\n\nTherefore, the replacement of windows in the dormitories is postponed indefinitely.\n\n**Flood\n**On Friday, the basement of dormitory 10 was flooded due to a pipe malfunction.\n\n@kpicampus",
        "sentiment": "negative",
        "rephrased_news": "Points of resilience will be established in working rooms 9, 13, and 14 of the dormitories, with shelters and functioning generators. Heating is expected to be available in the student campus by the end of the week. The installation of new windows for insulation has been delayed indefinitely due to incorrect specifications. Additionally, dormitory 10's basement was flooded on Friday due to a pipe malfunction.",
        "title": "Dormitory Resilience Points Established",
        "topic": "Deterioration in Infrastructure",
        "location_type": "exact location",
        "location": [
            "KPI Dormitory 19"
        ],
        "latitude": "50.4458979",
        "longitude": "30.3652466"
    },
    {
        "date": "2023-12-26T11:25:19+00:00",
        "channel_name": "Dormitory #19 KPI",
        "message_id": 370,
        "text": "🏘 **Masters Graduating**\n\nAt the last housing council meeting, it was decided that master's students who are graduating must vacate the dormitory within two weeks from the date of graduation.\n\n**Exceptions include:**\n• people with ONT/TOT;\n• applicants who plan to enter graduate school (for this, a submission from the faculty is required).\n\nTo continue living, these individuals will need to write an additional application to the dormitory manager and attach supporting documents.\n\n@kpicampus",
        "sentiment": "negative",
        "rephrased_news": "At the recent housing council meeting, it was decided that master's students graduating must vacate the dormitory within two weeks of graduation, with exceptions for individuals with ONT/TOT status and those planning to enter graduate school, provided they submit a request with supporting documents.",
        "title": "Graduating Masters Must Vacate",
        "topic": "Social Issues",
        "location_type": "exact location",
        "location": [
            "KPI Dormitory 19"
        ],
        "latitude": "50.4458979",
        "longitude": "30.3652466"
    },
    {
        "date": "2023-12-31T09:17:17+00:00",
        "channel_name": "Dormitory #19 KPI",
        "message_id": 371,
        "text": "☃️ **New Year Celebration**\n\nDuring the celebration, please remember that pyrotechnics, garlands, heaters, and electric stoves are prohibited. Consume alcohol responsibly. Do not forget to extinguish cigarette butts if you decide to smoke.\n\nOn the territory of the Student Campus, all of the above, even on New Year's Eve, [is a violation of the agreement](https://drive.google.com/file/d/1-8FNH6XMiaM3cjy9v8fcCykJHuFxRDXZ/view?usp=sharing) at your own risk.\n\nAlso, do not ignore air raid signals and go to the shelter.\n\n@kpicampus",
        "sentiment": "negative",
        "rephrased_news": "During New Year celebrations, the use of pyrotechnics, garlands, heaters, and electric stoves is prohibited, and responsible alcohol consumption is advised. Smokers should ensure cigarette butts are extinguished. Violations of these rules are at the individual's risk, and it is important to heed air raid signals and seek shelter.",
        "title": "New Year Safety Guidelines",
        "topic": "Public Safety Risks",
        "location_type": "exact location",
        "location": [
            "KPI Dormitory 19"
        ],
        "latitude": "50.4458979",
        "longitude": "30.3652466"
    },
    {
        "date": "2024-08-06T09:24:04+00:00",
        "channel_name": "Dormitory #19 KPI",
        "message_id": 372,
        "text": "🟢 **Administration 06.08**\n\n**Housing**\nWill begin on August 26, and by the end of the week, there will be lists for housing from faculties and institutes. In total, about 9,000 students are planned to be accommodated for mixed learning.\n\n**Masters**\nBy August 2, they were supposed to write a [request](https://docs.google.com/document/d/13FJxmoUKzXYeRo9T8oGxshdi3MXm1faIDpQwAO6Tk1E/edit?usp=sharing) for a change in payment format and an extension of residence in the dormitory until August 31.\n\nIf you did not write a request, please contact the head of the dormitory.\n\n**Hot Water**\nIn some dormitories, there has been no hot water for 3 months due to major repair work.\n\n**Elevators**\nDue to the stabilization of electricity supply, the operation of most elevators will be restored.\n\n@kpicampus",
        "sentiment": "positive",
        "rephrased_news": "Housing arrangements will begin on August 26, with lists from faculties and institutes expected by the end of the week for approximately 9,000 students. Master's students were required to submit requests for payment changes and dormitory extensions by August 2. Some dormitories have been without hot water for three months due to repairs, but elevator operations will resume due to improved electricity supply.",
        "title": "Housing Lists for Students Coming",
        "topic": "Improvements in Infrastructure",
        "location_type": "exact location",
        "location": [
            "KPI Dormitory 19"
        ],
        "latitude": "50.4458979",
        "longitude": "30.3652466"
    },
    {
        "date": "2024-08-14T08:05:25+00:00",
        "channel_name": "Dormitory #19 KPI",
        "message_id": 373,
        "text": "🔑 **Housing for Senior Students**\n\nStudents of 2nd to 4th year of bachelor's degree and 2nd year of master's degree who fall under priority categories can move in from **August 26** to **September 15** for the new academic year. If you are moving in for the first time, make sure to do it **by September 5.**\n\nFirst-year master's students will move in **from September 10 to 15**.\n\n**Priority Categories:**\n1. People with ONT/TOT, children of parents with disabilities, orphans, and children deprived of parental care.\n2. Those who are on the [lists of in-person disciplines](https://t.me/sr_kpi/4925).\n\nFollow the [housing algorithm](https://telegra.ph/Poselennya-studentstva-starshih-kurs%D1%96v-08-13#%D0%9D%D0%B5%D0%BE%D0%B1%D1%85%D1%96%D0%B4%D0%BD%D1%96-%D0%B4%D0%BE%D0%BA%D1%83%D0%BC%D0%B5%D0%BD%D1%82%D0%B8).\n\nIf you have questions, write to @kpicampus_bot\n\n@kpicampus",
        "sentiment": "positive",
        "rephrased_news": "Students in their 2nd to 4th year of bachelor's programs and 2nd year of master's programs in priority categories can move in from August 26 to September 15. First-year master's students may move in from September 10 to 15. Priority categories include individuals with ONT/TOT status, children of parents with disabilities, orphans, and those listed for in-person disciplines.",
        "title": "Senior Students Housing Dates",
        "topic": "Social Progress",
        "location_type": "exact location",
        "location": [
            "KPI Dormitory 19"
        ],
        "latitude": "50.4458979",
        "longitude": "30.3652466"
    },
    {
        "date": "2024-08-23T15:11:01+00:00",
        "channel_name": "Dormitory #19 KPI",
        "message_id": 374,
        "text": "🙌 **Recruitment of Volunteers for Housing Assistance**\n\nWe are looking for volunteers who are ready to help with the accommodation of newcomers! This is a great opportunity to meet new people and make the lives of first-year students in the student campus easier.\n\nIf you have some free time and want to do something useful – fill out the [form at the link](https://forms.gle/3i48ThrZcRTxM3e68) **by August 25 inclusive.** We look forward to having you on our team!\n\n@kpicampus",
        "sentiment": "positive",
        "rephrased_news": "Volunteers are sought to assist with the accommodation of newcomers, providing an opportunity to meet new people and support first-year students. Interested individuals should complete the application form by August 25.",
        "title": "Volunteers Needed for Housing",
        "topic": "Community Events or Achievements",
        "location_type": "exact location",
        "location": [
            "KPI Dormitory 19"
        ],
        "latitude": "50.4458979",
        "longitude": "30.3652466"
    },
    {
        "date": "2024-08-28T14:47:04+00:00",
        "channel_name": "Dormitory #19 KPI",
        "message_id": 375,
        "text": "🌡 **Hot Water Shutdown**\n\nDue to emergency work by Kyivteploenergo, there is no hot water in some dormitories. **\n\nHot water supply is planned to be restored by the evening of August 29.\n\n@kpicampus",
        "sentiment": "negative",
        "rephrased_news": "Some dormitories are currently without hot water due to emergency work by Kyivteploenergo, with restoration planned by the evening of August 29.",
        "title": "Hot Water Outage Update",
        "topic": "Citizen Discomfort",
        "location_type": "exact location",
        "location": [
            "KPI Dormitory 19"
        ],
        "latitude": "50.4458979",
        "longitude": "30.3652466"
    }
]